dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_regdef.h
/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZEA_BND_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZEA_BND;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZEA_RNG_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZEA_RNG;

/** \brief Event Definition Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZEVT_Bits B;           /**< \brief Bitfield access */
} Ifx_MCDS_TCZEVT;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZID_BND_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZID_BND;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZID_MSK_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZID_MSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZID_RNG_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZID_RNG;

/** \brief Comparator Sign Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZID_SGN_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZID_SGN;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZIP_BND_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZIP_BND;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZIP_RNG_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZIP_RNG;

/** \brief Lookup Table Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZPALLUTA_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_TCZPALLUTA;

/** \brief Lookup Table Data Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZPALLUTD_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_TCZPALLUTD;

/** \brief Lookup Table Base Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZPAL_BND_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_TCZPAL_BND;

/** \brief Lookup Table Mapping Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZPAL_MAP_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_TCZPAL_MAP;

/** \brief Lookup Table Range Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZPAL_RNG_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_TCZPAL_RNG;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZWD_BND_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZWD_BND;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZWD_HBND_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_TCZWD_HBND;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZWD_HMSK_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_TCZWD_HMSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZWD_HRNG_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_TCZWD_HRNG;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZWD_MSK_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZWD_MSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZWD_RNG_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZWD_RNG;

/** \brief Comparator Sign Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TCZWD_SGN_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TCZWD_SGN;

/** \brief Clock Counter Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TSUEMUCNT_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TSUEMUCNT;

/** \brief Clock Prescaler Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TSUPRSCL_Bits B;         /**< \brief Bitfield access */
} Ifx_MCDS_TSUPRSCL;

/** \brief Clock Counter Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_TSUREFCNT_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_TSUREFCNT;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_MCX_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief MCX object */
typedef volatile struct _Ifx_MCDS_MCX
{
       Ifx_MCDS_MCX_CCL                    CCL;                    /**< \brief 0, Counter Control Register*/
       Ifx_MCDS_MCX_LMT                    LMT;                    /**< \brief 4, Counter Limit Register*/
       Ifx_MCDS_MCX_CNT                    CNT;                    /**< \brief 8, Current Count Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_MCX;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCXPAL_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXPAL object */
typedef volatile struct _Ifx_MCDS_TCXPAL
{
       Ifx_MCDS_TCXPAL_BND                 BND;                    /**< \brief 0, Lookup Table Base Register*/
       Ifx_MCDS_TCXPAL_RNG                 RNG;                    /**< \brief 4, Lookup Table Range Register*/
       Ifx_MCDS_TCXPAL_MAP                 MAP;                    /**< \brief 8, Lookup Table Mapping Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_TCXPAL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCXEA_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXEA object */
typedef volatile struct _Ifx_MCDS_TCXEA
{
       Ifx_MCDS_TCXEA_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCXEA_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_TCXEA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCXWD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXWD object */
typedef volatile struct _Ifx_MCDS_TCXWD
{
       Ifx_MCDS_TCXWD_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCXWD_HBND                 HBND;                   /**< \brief 4, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCXWD_RNG                  RNG;                    /**< \brief 8, Comparator Range Register ${x}*/
       Ifx_MCDS_TCXWD_HRNG                 HRNG;                   /**< \brief C, Comparator Range Register ${x}*/
       Ifx_MCDS_TCXWD_MSK                  MSK;                    /**< \brief 10, Comparator Mask Register ${x}*/
       Ifx_MCDS_TCXWD_HMSK                 HMSK;                   /**< \brief 14, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_18[4];         /**< \brief 18, \internal Reserved */
       Ifx_MCDS_TCXWD_SGN                  SGN;                    /**< \brief 1C, Comparator Sign Register ${x}*/
} Ifx_MCDS_TCXWD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCXAC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXAC object */
typedef volatile struct _Ifx_MCDS_TCXAC
{
       Ifx_MCDS_TCXAC_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCXAC_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_TCXAC_MSK                  MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_TCXAC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCXID_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXID object */
typedef volatile struct _Ifx_MCDS_TCXID
{
       Ifx_MCDS_TCXID_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCXID_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_TCXID_MSK                  MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_MCDS_TCXID_SGN                  SGN;                    /**< \brief C, Comparator Sign Register ${x}*/
} Ifx_MCDS_TCXID;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCXIP_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXIP object */
typedef volatile struct _Ifx_MCDS_TCXIP
{
       Ifx_MCDS_TCXIP_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCXIP_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_TCXIP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCYPAL_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYPAL object */
typedef volatile struct _Ifx_MCDS_TCYPAL
{
       Ifx_MCDS_TCYPAL_BND                 BND;                    /**< \brief 0, Lookup Table Base Register*/
       Ifx_MCDS_TCYPAL_RNG                 RNG;                    /**< \brief 4, Lookup Table Range Register*/
       Ifx_MCDS_TCYPAL_MAP                 MAP;                    /**< \brief 8, Lookup Table Mapping Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_TCYPAL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCYEA_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYEA object */
typedef volatile struct _Ifx_MCDS_TCYEA
{
       Ifx_MCDS_TCYEA_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCYEA_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_TCYEA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCYWD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYWD object */
typedef volatile struct _Ifx_MCDS_TCYWD
{
       Ifx_MCDS_TCYWD_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCYWD_HBND                 HBND;                   /**< \brief 4, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCYWD_RNG                  RNG;                    /**< \brief 8, Comparator Range Register ${x}*/
       Ifx_MCDS_TCYWD_HRNG                 HRNG;                   /**< \brief C, Comparator Range Register ${x}*/
       Ifx_MCDS_TCYWD_MSK                  MSK;                    /**< \brief 10, Comparator Mask Register ${x}*/
       Ifx_MCDS_TCYWD_HMSK                 HMSK;                   /**< \brief 14, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_18[4];         /**< \brief 18, \internal Reserved */
       Ifx_MCDS_TCYWD_SGN                  SGN;                    /**< \brief 1C, Comparator Sign Register ${x}*/
} Ifx_MCDS_TCYWD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCYAC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYAC object */
typedef volatile struct _Ifx_MCDS_TCYAC
{
       Ifx_MCDS_TCYAC_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCYAC_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_TCYAC_MSK                  MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_TCYAC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCYID_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYID object */
typedef volatile struct _Ifx_MCDS_TCYID
{
       Ifx_MCDS_TCYID_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCYID_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_TCYID_MSK                  MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_MCDS_TCYID_SGN                  SGN;                    /**< \brief C, Comparator Sign Register ${x}*/
} Ifx_MCDS_TCYID;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCYIP_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYIP object */
typedef volatile struct _Ifx_MCDS_TCYIP
{
       Ifx_MCDS_TCYIP_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCYIP_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_TCYIP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SPBEA_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SPBEA object */
typedef volatile struct _Ifx_MCDS_SPBEA
{
       Ifx_MCDS_SPBEA_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SPBEA_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_SPBEA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SPBWD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SPBWD object */
typedef volatile struct _Ifx_MCDS_SPBWD
{
       Ifx_MCDS_SPBWD_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SPBWD_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_SPBWD_MSK                  MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_MCDS_SPBWD_SGN                  SGN;                    /**< \brief C, Comparator Sign Register ${x}*/
} Ifx_MCDS_SPBWD;
